#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/th3pl4gu3-prod/github-api-workspace/runs/run-KrJCHaWYVWuMFW2Y

Waiting for the plan to start...

Terraform v1.3.3
on linux_amd64
Initializing plugins and modules...
module.email-function.data.external.archive_prepare[0]: Reading...
module.email-function.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.email-function.local_file.archive_plan[0]: Refreshing state... [id=d8bea02f4fa0655c8b6596bd36157fb8a43052ae]
module.email-function.null_resource.archive[0]: Refreshing state... [id=6941343237767997120]
module.email-function.data.aws_partition.current: Reading...
aws_budgets_budget.monthly_limit_budget: Refreshing state... [id=371497173983:monthly-limit-budget]
module.email-function.data.aws_partition.current: Read complete after 0s [id=aws]
module.email-function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/email-function]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.email-function.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "The lambda for sending emails from contact forms"
      + filename                       = "builds/f5df9b0328a7549f93cbf45498414ad47952e9aa7b1baca906256c7cfe516f6a.zip"
      + function_name                  = "email-function"
      + handler                        = "main.main"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = 2
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Creator"     = "mervin.hemaraju"
          + "Environment" = "Production"
          + "Project"     = "th3pl4gu3-aws"
          + "Usage"       = "Personal"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = 512
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.email-function.aws_lambda_function_event_invoke_config.this["current_version"] will be created
  + resource "aws_lambda_function_event_invoke_config" "this" {
      + function_name          = "email-function"
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
      + qualifier              = (known after apply)
    }

  # module.email-function.aws_lambda_function_event_invoke_config.this["unqualified_alias"] will be created
  + resource "aws_lambda_function_event_invoke_config" "this" {
      + function_name          = "email-function"
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.email-function.null_resource.archive[0] is tainted, so must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6941343237767997120" -> (known after apply)
      ~ triggers = {
          ~ "timestamp" = "1666462898653537000" -> "1666463538659630000"
            # (1 unchanged element hidden)
        }
    }

Plan: 4 to add, 0 to change, 1 to destroy.


```

</details>

*Pusher: @mervinhemaraju, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*